app/Controllers/Api/OrderController.php

SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT *
FROM `orders`
ORDER BY `id` ASC
 LIMIT 10
---
    public function index()
{
    $orderModel = new OrderModel();
    $orderItemModel = new OrderItemModel();
    $paymentModel = new PaymentModel();

    // Pagination inputs
    $page = (int) ($this->request->getGet('page') ?? 1);
    $limit = (int) ($this->request->getGet('limit') ?? 10);

    // Validate page
    if ($page < 1) {
        $page = 1;
    }

    // Prevent very large requests
    if ($limit < 1) {
        $limit = 10;
    }

    if ($limit > 100) {
        $limit = 100;
    }

    $offset = ($page - 1) * $limit;

    // Total orders
    $total = $orderModel->countAll();

    // Get only requested orders
    $orders = $orderModel
        ->orderBy('id', 'ASC')
        ->findAll($limit, $offset);

SELECT `order_items`.`id`, `order_items`.`order_id`, `order_items`.`item_id`, `order_items`.`size`, `order_items`.`price`, `order_items`.`quantity`, `order_items`.`total`, `menu_items`.`name` AS `item_name`
FROM `order_items`
INNER JOIN `menu_items` ON `menu_items`.`id` = `order_items`.`item_id`
WHERE `order_items`.`order_id` IN ('10','11','12','13','14','15','16','17','18','19')
ORDER BY `order_items`.`order_id` ASC, `order_items`.`id` ASC
---
    $orderIds = array_column($orders, 'id');

    // Get all items for these orders in one query
    $items = $orderItemModel
        ->select('
            order_items.id,
            order_items.order_id,
            order_items.item_id,
            order_items.size,
            order_items.price,
            order_items.quantity,
            order_items.total,
            menu_items.name AS item_name
        ')
        ->join(
            'menu_items',
            'menu_items.id = order_items.item_id',
            'inner'
        )
        ->whereIn('order_items.order_id', $orderIds)
        ->orderBy('order_items.order_id', 'ASC')
        ->orderBy('order_items.id', 'ASC')
        ->findAll();