app/Controllers/CartController.php

    public function add()
    {
        $itemId = (int) $this->request->getPost('item_id');

        if ($itemId <= 0) {
            return redirect()
                ->back()
                ->with('error', 'Invalid item');
        }

        $model = new CartProductModel();

        $item = $model
            ->where('id', $itemId)
            ->where('status', 1)
            ->first();
---
SELECT *
FROM `cart_products`
WHERE `id` = 3
AND `status` = 1
 LIMIT 1

    private function getItems(): array
    {
        $model = new CartProductModel();

        $items = $model
            ->where('status', 1)
            ->orderBy('id', 'ASC')
            ->findAll();
---
SELECT *
FROM `cart_products`
WHERE `status` = 1
ORDER BY `id` ASC

    public function updateQuantity()
    {
        $itemId = (int) $this->request->getPost('item_id');
        $quantity = (int) $this->request->getPost('quantity');

        if ($itemId <= 0) {
            return $this->response
                ->setStatusCode(400)
                ->setJSON([
                    'success' => false,
                    'message' => 'Invalid item'
                ]);
        }

        if ($quantity < 1) {
            return $this->response
                ->setStatusCode(400)
                ->setJSON([
                    'success' => false,
                    'message' => 'Quantity must be at least 1'
                ]);
        }

        $model = new CartProductModel();

        $item = $model
            ->where('id', $itemId)
            ->where('status', 1)
            ->first();
---
SELECT *
FROM `cart_products`
WHERE `id` = 1
AND `status` = 1
 LIMIT 1